app/Controllers/ApiUsuarioController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`Id` = '17'
---
    public function ApiLogin()
    {

        $UsuarioModel=new UsuarioModel();

            $Email=$this->request->getVar('Email');
            $Pass=$this->request->getVar('Pass');

        $UsuarioEncontrado=$UsuarioModel->getWhere(['Email'=>$Email,'Pass'=>$Pass])->getResult();