app/Controllers/NotasController.php

    public function SeleccionarNotas($Idusuario)
    {
        $NotasModel=new NotasModel();
        $Data['Notas']=$NotasModel->getwhere(['Id_usuario'=>$Idusuario])->getResult();
---
SELECT *
FROM `notas`
WHERE `Id_usuario` = '1'