app/Controllers/NotasController.php

SELECT *
FROM `notas`
WHERE `Id_usuario` IS NULL
ORDER BY `id` DESC
---
    public function Notas()
    {
        $NotasModel=new NotasModel();
        $this->session=session();
        //Obtener todas las notas de cada usuario ordenadas por id de forma descendente
        $Id_usuario=$this->session->get('Id');
        $Notas=$NotasModel->orderBy('id','desc')->getWhere(['Id_usuario'=>$Id_usuario])->getResultArray();