app/Controllers/UsuarioController.php

        public function Login()
        {
            $UsuarioModel= new UsuarioModel();
            $Email=$this->request->getVar('Email');
            $Pass=$this->request->getVar('Contraseña');
            $UsuarioEncontrado=$UsuarioModel->getWhere(['Email'=>$Email,'Pass'=>$Pass])->getResult();
---
SELECT *
FROM `usuarios`
WHERE `Email` = 'orlando234@gmail.com'
AND `Pass` = 'asd'