app/Controllers/UsuarioController.php

    public function VistaPerfil()
    {
        $UsuarioModel=new UsuarioModel();
        $this->session=session();
        $Id=$this->session->get('Id');

        $Usuario=$UsuarioModel->find($Id);
---
SELECT *
FROM `usuarios`
WHERE `usuarios`.`Id` = '28'

    public function Login()
    {
        $UsuarioModel= new UsuarioModel();
        $Email=$this->request->getVar('Email');
        $Pass=$this->request->getVar('Contraseña');
        $UsuarioEncontrado=$UsuarioModel->getWhere(['Email'=>$Email,'Pass'=>$Pass])->getResultArray();
---
SELECT *
FROM `usuarios`
WHERE `Email` = 'carolina2@gmail.com'
AND `Pass` = 'ASDf'

    public function UpdateEmail()
    {
        $UsuarioModel=new UsuarioModel();
        $this->session=session();

        $EmailAntiguo= $this->request->getVar('Email_Antiguo');
        $Contraseña= $this->request->getVar('Contraseña');
        //Email a actualizar
        $NuevoEmail= $this->request->getVar('Nuevo_Email');                                          //me retorna solo una fila
        $UsuarioEncontrado=$UsuarioModel->getWhere(['Email'=>$EmailAntiguo,'Pass'=>$Contraseña])->getRow();
        $UsuarioRepetido=$UsuarioModel->getWhere(['Email'=>$NuevoEmail])->getRow();
---
SELECT *
FROM `usuarios`
WHERE `Email` = 'orlando2@gmail.com'
AND `Pass` = 'asdf'
SELECT *
FROM `usuarios`
WHERE `Email` = 'orlando23232323@gmail.com'

            ];
            $this->session->set($Datossesion);
            //el segundo parametro en este metodo recibe array por eso hago un array arriba
            $UsuarioModel->update($Id,$data);
---
UPDATE `usuarios` SET `Email` = 'orlando23232323@gmail.com'
WHERE `usuarios`.`Id` IN ('62')